package day0720.ch09;

public abstract class Car {

	//------------------------------------------
	// 추상 메서드 선언
	//------------------------------------------
	public abstract void drive();
	public abstract void stop();
	
	//------------------------------------------
	// 메서드 선언
	//------------------------------------------
	public void startCar() {
		System.out.println("시동을 켠다.");
	}
	
	public void turnOff() {
		System.out.println("시동을 끈다.");
	}
	
	//------------------------------------------
	// 템플릿 메서드 선언
	//------------------------------------------
	final public void run() {
		startCar();
		drive();
		stop();
		turnOff();
	}
	
	/* =========================================
	 * 템플릿 메서드
	 * 디자인 패턴의 한 방법이다.
	 * =========================================
	 */
	
}
